IDEA StatiCa Open Model
TemperatureLoadOnLine.DirectionEdges Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Edges of direction
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CrossSectionComponentEdges> DirectionEdges { get; set; }
Public Property DirectionEdges As List(Of CrossSectionComponentEdges)
	Get
	Set
public:
property List<CrossSectionComponentEdges^>^ DirectionEdges {
	List<CrossSectionComponentEdges^>^ get ();
	void set (List<CrossSectionComponentEdges^>^ value);
}
Property Value
Type: List<CrossSectionComponentEdges>
See Also
Reference
TemperatureLoadOnLine Class
IdeaRS.OpenModel.Loading Namespace